; domain
(define (domain Four-Knight)
    (:requirements :negative-preconditions )
    (:predicates
        (at ?knight ?pos1 ?pos2)              ; a kight position defined by col and row
        (diff_by_one ?pos1 ?pos2)   ; two col or row difference is one or not indication
        (diff_by_two ?pos1 ?pos2)   ; two col or row difference is two or not indication
        (empty ?col ?row)           ; a position is empty or not indication
        )
    
    (:action move_knight_2col_1row     ;move knight as knight move 2 column and 1 row
        :parameters (?knight ?from_col ?from_row ?to_col ?to_row)
        :precondition (and (at ?knight ?from_col ?from_row)                 ; knight must at from_col from_row position
                            (empty ?to_col ?to_row)                 ; to_col to_row must be empty to move a knight
                            (diff_by_two ?from_col ?to_col)         ; must diffence between from and to column is 2
                            (diff_by_one ?from_row ?to_row)         ; must difference between from and to row is 1
        )
        :effect (and (not (at ?knight ?from_col ?from_row))         ; not at from_col from_row position
                    (at ?knight ?to_col ?to_row)                    ; now at to_col and to_row position
                    (empty ?from_col ?from_row)             ; making empty from_col from_row position
                    (not (empty ?to_col ?to_row))           ; making not empty to_col to_row position
        )
    )

    (:action move_knight_2row_1col                  ;move knight as knight move 1 column and 2 row
        :parameters (?knight ?from_col ?from_row ?to_col ?to_row)
        :precondition (and (at ?knight ?from_col ?from_row)                 ; knight must at from_col from_row position
                            (empty ?to_col ?to_row)                 ; to_col to_row must be empty to move a knight
                            (diff_by_one ?from_col ?to_col)         ; must diffence between from and to column is 1
                            (diff_by_two ?from_row ?to_row)         ; must difference between from and to row is 2
        )
        :effect (and (not (at ?knight ?from_col ?from_row))         ; not at from_col from_row position
                    (at ?knight ?to_col ?to_row)                    ; now at to_col and to_row position
                    (empty ?from_col ?from_row)             ; making empty from_col from_row position
                    (not (empty ?to_col ?to_row))           ; making not empty to_col to_row position 
        )
    )
    
)

; problem
(define (problem Four-Knight3x3problem) 
    (:domain Four-Knight)
    (:objects 
        pos1 pos2 pos3                        ; position of chess board from 1 to 3
        knight1 knight2 knight3 knight4       ; 4 knight
    )

    (:init
        (at knight1 pos1 pos3)                ; knight1 is at col 1 row 3 on upper left position
        (at knight2 pos3 pos3)                ; knight2 is at col 3 row 3 on upper right position
        (at knight3 pos1 pos1)                ; knight3 is at col 1 row 1 on lower left position
        (at knight4 pos3 pos1)                ; knight4 is at col 3 row 1 on lower right position

        (empty pos1 pos2)                     ; empty at col 1 and row 2 position
        (empty pos2 pos1)                     ; empty at col 2 and row 1 position
        (empty pos2 pos2)                     ; empty at col 2 and row 2 position
        (empty pos2 pos3)                     ; empty at col 2 and row 3 position
        (empty pos3 pos2)                     ; empty at col 3 and row 2 position
        
        (diff_by_one pos1 pos2)
        (diff_by_one pos2 pos1)
        (diff_by_one pos2 pos3)
        (diff_by_one pos3 pos2)

        (diff_by_two pos1 pos3)
        (diff_by_two pos3 pos1)
        )

    (:goal (and
        (at knight1 pos3 pos1)                ; knight1 is aim to be at col 3 row 1 
        (at knight2 pos1 pos1)                ; knight2 is aim to be at col 1 row 1 
        (at knight3 pos3 pos3)                ; knight3 is aim to be at col 3 row 3 
        (at knight4 pos1 pos3)                ; knight4 is aim to be at col 1 row 3 
    ))
)

; plan
1. (move_knight_2row_1col knight1 pos1 pos3 pos2 pos1)
   deleted: (at knight1 pos1 pos3) (empty pos2 pos1)
   added: (at knight1 pos2 pos1) (empty pos1 pos3)
   goals met: 0 of 4
2. (move_knight_2col_1row knight2 pos3 pos3 pos1 pos2)
   deleted: (at knight2 pos3 pos3) (empty pos1 pos2)
   added: (at knight2 pos1 pos2) (empty pos3 pos3)
   goals met: 0 of 4
3. (move_knight_2row_1col knight4 pos3 pos1 pos2 pos3)
   deleted: (at knight4 pos3 pos1) (empty pos2 pos3)
   added: (at knight4 pos2 pos3) (empty pos3 pos1)
   goals met: 0 of 4
4. (move_knight_2row_1col knight1 pos2 pos1 pos3 pos3)
   deleted: (at knight1 pos2 pos1) (empty pos3 pos3)
   added: (at knight1 pos3 pos3) (empty pos2 pos1)
   goals met: 0 of 4
5. (move_knight_2col_1row knight3 pos1 pos1 pos3 pos2)
   deleted: (at knight3 pos1 pos1) (empty pos3 pos2)
   added: (at knight3 pos3 pos2) (empty pos1 pos1)
   goals met: 0 of 4
6. (move_knight_2row_1col knight4 pos2 pos3 pos1 pos1)
   deleted: (at knight4 pos2 pos3) (empty pos1 pos1)
   added: (at knight4 pos1 pos1) (empty pos2 pos3)
   goals met: 0 of 4
7. (move_knight_2col_1row knight2 pos1 pos2 pos3 pos1)
   deleted: (at knight2 pos1 pos2) (empty pos3 pos1)
   added: (at knight2 pos3 pos1) (empty pos1 pos2)
   goals met: 0 of 4
8. (move_knight_2row_1col knight2 pos3 pos1 pos2 pos3)
   deleted: (at knight2 pos3 pos1) (empty pos2 pos3)
   added: (at knight2 pos2 pos3) (empty pos3 pos1)
   goals met: 0 of 4
9. (move_knight_2col_1row knight1 pos3 pos3 pos1 pos2)
   deleted: (at knight1 pos3 pos3) (empty pos1 pos2)
   added: (at knight1 pos1 pos2) (empty pos3 pos3)
   goals met: 0 of 4
10. (move_knight_2col_1row knight1 pos1 pos2 pos3 pos1)
   deleted: (at knight1 pos1 pos2) (empty pos3 pos1)
   added: (at knight1 pos3 pos1) (empty pos1 pos2)
   goals met: 1 of 4
11. (move_knight_2col_1row knight3 pos3 pos2 pos1 pos3)
   deleted: (at knight3 pos3 pos2) (empty pos1 pos3)
   added: (at knight3 pos1 pos3) (empty pos3 pos2)
   goals met: 1 of 4
12. (move_knight_2row_1col knight3 pos1 pos3 pos2 pos1)
   deleted: (at knight3 pos1 pos3) (empty pos2 pos1)
   added: (at knight3 pos2 pos1) (empty pos1 pos3)
   goals met: 1 of 4
13. (move_knight_2row_1col knight3 pos2 pos1 pos3 pos3)
   deleted: (at knight3 pos2 pos1) (empty pos3 pos3)
   added: (at knight3 pos3 pos3) (empty pos2 pos1)
   goals met: 2 of 4
14. (move_knight_2col_1row knight4 pos1 pos1 pos3 pos2)
   deleted: (at knight4 pos1 pos1) (empty pos3 pos2)
   added: (at knight4 pos3 pos2) (empty pos1 pos1)
   goals met: 2 of 4
15. (move_knight_2row_1col knight2 pos2 pos3 pos1 pos1)
   deleted: (at knight2 pos2 pos3) (empty pos1 pos1)
   added: (at knight2 pos1 pos1) (empty pos2 pos3)
   goals met: 3 of 4
16. (move_knight_2col_1row knight4 pos3 pos2 pos1 pos3)
   deleted: (at knight4 pos3 pos2) (empty pos1 pos3)
   added: (at knight4 pos1 pos3) (empty pos3 pos2)
   goals met: 4 of 4
